In [1]:
import pandas as pd

## 병합

In [2]:
# Sample DataFrames
df1 = pd.DataFrame({'A': [1, 'A_2', 3]}, index=[0, 1, 2])
df2 = pd.DataFrame({'B': [4, 'B_5', 6]}, index=[3, 4, 5])

In [3]:
df1

     A
0    1
1  A_2
2    3

In [4]:
df2

     B
3    4
4  B_5
5    6

In [5]:
# size는 같음. 옆으로 병합되나 index 번호대로 붙게 됨
pd.concat([df1, df2], axis=1) # 선 조치 필요

     A    B
0    1  NaN
1  A_2  NaN
2    3  NaN
3  NaN    4
4  NaN  B_5
5  NaN    6

In [6]:
df1.count(), df2.count()  # size 동일

(A    3
 dtype: int64,
 B    3
 dtype: int64)

In [7]:
# column이 2개가 됨
df1.reset_index() # 원래 index번호가 새로운 columns으로 이동하게 됨

   index    A
0      0    1
1      1  A_2
2      2    3

In [8]:
df2.reset_index()

   index    B
0      3    4
1      4  B_5
2      5    6

In [9]:
# index column drop
df1_reset = df1.reset_index(drop=True)
df1_reset

     A
0    1
1  A_2
2    3

In [10]:
df2_reset = df2.reset_index(drop=True)
df2_reset

     B
0    4
1  B_5
2    6

In [11]:
pd.concat([df1_reset, df2_reset], axis=1)

     A    B
0    1    4
1  A_2  B_5
2    3    6

In [16]:
df3 = pd.DataFrame({'B': ['4', 'None', '6']}, index=[3, 4, 5])

In [17]:
df3.isnull()

       B
3  False
4  False
5  False

In [32]:
def convertSICK_SYM(sick_sym) :
    if len(sick_sym) < 3 :
        return None
    else :
        return sick_sym[:3]

# null값을 넣고 싶을 때 패키지에 따라 다름
# pandas : pd.NA
# Numpy : np.Nan
# 파이썬 : None

In [36]:
df3['B'] = df3['B'].apply(convertSICK_SYM)
df3

TypeError: object of type 'NoneType' has no len()

In [37]:
df3.isnull()

       B
3   True
4  False
5   True